create_clock -period 40.000 -name clk -waveform {0.000 5.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {load[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {load[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports en]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports en]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.250 [get_ports {count[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {count[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.250 [get_ports {tcount[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {tcount[*]}]

set_property IOSTANDARD LVCMOS33 [get_ports {count[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {count[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {count[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {count[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {count[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {count[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {count[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {count[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {load[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {load[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {load[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {load[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {load[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {load[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {load[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {load[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {tcount[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {tcount[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports clk]
set_property IOSTANDARD LVCMOS33 [get_ports en]
set_property IOSTANDARD LVCMOS33 [get_ports rst]
set_property PACKAGE_PIN R2 [get_ports en]
set_property PACKAGE_PIN T1 [get_ports rst]
set_property PACKAGE_PIN V14 [get_ports {count[7]}]
set_property PACKAGE_PIN U14 [get_ports {count[6]}]
set_property PACKAGE_PIN U15 [get_ports {count[5]}]
set_property PACKAGE_PIN W18 [get_ports {count[4]}]
set_property PACKAGE_PIN V19 [get_ports {count[3]}]
set_property PACKAGE_PIN U19 [get_ports {count[2]}]
set_property PACKAGE_PIN U16 [get_ports {count[0]}]
set_property PACKAGE_PIN E19 [get_ports {count[1]}]
set_property PACKAGE_PIN W13 [get_ports {load[7]}]
set_property PACKAGE_PIN W14 [get_ports {load[6]}]
set_property PACKAGE_PIN V15 [get_ports {load[5]}]
set_property PACKAGE_PIN W15 [get_ports {load[4]}]
set_property PACKAGE_PIN W17 [get_ports {load[3]}]
set_property PACKAGE_PIN W16 [get_ports {load[2]}]
set_property PACKAGE_PIN V16 [get_ports {load[1]}]
set_property PACKAGE_PIN V17 [get_ports {load[0]}]
set_property PACKAGE_PIN L1 [get_ports {tcount[1]}]
set_property PACKAGE_PIN P1 [get_ports {tcount[0]}]
set_property PACKAGE_PIN W5 [get_ports clk]
